# Testing
brew "atuin"
brew "glow"
brew "duf"
brew "dust"
brew "btop"

# OS
brew "bash"
brew "cmake"
brew "eza"
brew "git-delta"
brew "fzf"
brew "git"
brew "mise"
brew "neovim"
brew "openssl"
brew "rcm"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rga" # ripgrep-all
brew "starship"
brew "tmux"
brew "watchman"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
cask "qlmarkdown"
cask "qlstephen"
cask "font-hack-nerd-font"

# Utilities
brew "bat"
brew "cloc"
brew "fd"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "qt5"
brew "shellcheck"
brew "ssh-copy-id"
brew "tree"

# Programming language prerequisites and package managers
brew "coreutils"
brew "libyaml" # should come after openssl
cask "gpg-suite"

# Databases
brew "postgresql"
brew "redis"

brew "zsh-syntax-highlighting"
brew "zsh-history-substring-search"
